#!/usr/bin/python
# -*- coding: UTF-8 -*-
'''
# boo 是basic or other的缩写 意思是： 基础 或 其他未分类
创建： 2018-1-8 08:51:50
'''
import traceback  # 获取错误信息
import os
import time
import random
import hashlib

# print "cnLib"
# os.system('pause') #按任意键继续。

# while 1:
#    pass

# print __name__

# os.system('pause') # 按回车继续执行

# ---------------------------------------------------------------------------

'''
# 功能：
# 时间：
# 返回： =0失败，=1成功
# 参数：
# 实例： re = demo(u'传入参数')
'''
def model(IN):
    return 1  # 返回说明
    return None  # 返回说明
    return True  # 返回说明
# ------------------------------------------------------------------


'''
# 功能：截取字符串
# 时间：
# 返回： =0失败，=1成功
# 参数：
    srcStr 源字符串
    a_str 起点字符串
    z_str 终点字符串
# 实例： re = demo(u'传入参数')
'''
def getStringA_Z(srcStr, a_str, z_str):
    try:
        if str != type(srcStr):
            return  # 非字符串

        reString = None
        # a_str = '{global.jsonData='
        # z_str = ';})(typeof(page) ==='
        if '' == a_str:
            a_point = 0  # 空值 则表示0起点
        else:
            a_point = srcStr.find(a_str)

        if -1 < a_point:
            a_point += len(a_str)
            if '' == z_str:
                reString = srcStr[a_point:]
                # z_point = len(srcStr)  # 空值 则表示全部
            else:
                z_point = srcStr.find(z_str, a_point)
                if z_point > a_point:
                    reString = srcStr[a_point:z_point]

        return reString  # 返回说明
    except Exception as e:
        print(e)
        return

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------

# ------------------------------------------------------------------
